
def codficar():
 text=input("Escreva o texto que sera codificado ")
 alfabeto = [
    "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m",
    "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z"
]

 keycod=[
"¤",
"8",
"{",
"¥",
"╬",
"Þ",
"%", 
"?",
"±",
"¬",
"╔",
"µ",
"┐",
"└",
"Ø",
"ß",
"Ð",
"¢",
";",
"°",
"/",
"@",
"ð",
"§",
"|",
"'",
 ]

 text=text.lower()
 
 #text=text.replace(""," ")
 loop=0
 for keycode in alfabeto:
  
  text=text.replace(alfabeto[loop],keycod[loop])
  loop+=1
  
 print(text)

def desficar():
 #textc=input("Escreva o texto que sera descodificar ")

 textct=("""╬;;╬ µ±@¢Ø ╬ ╬§×¢╬┐¤┐╬└×╬ ßØ¥╬¢Ø;Ø ßØ¢╬┐ ß╬¢±/Ø;Ø, ¤Ð/╬µ╬ Ð/╬ ╬;×±@╬¢ ╬┐ ßØ;;╬ ¥Ø µ±@¢Ø ;╬¢¤ {Ø└;±¥╬¢¤¥Ø Ø ¥Ø└Ø, Ø ┐/¢╬µØ└Ø┐±Ø ×╬┐ /┐¤ ?¤8±µ±¥¤¥╬ ╬§×¢╬┐¤┐╬└×╬ ÞØ¢×╬ ßØ¢╬┐ {Ø┐ ;╬/; ¢±;{Ø;, ╬;;¤ ?¤8±µ±¥¤¥╬ ß╬¢┐±×╬ ¤Ø /;/¤¢±Ø ¤ß¤/¤¢ /┐ ;±;×╬┐¤ ¥Ø ┐/└¥Ø, Ð/¤└¥Ø ¤ß¤/¤¥Ø ╬;;╬ ;±;×╬┐¤ ¥╬±§¤¢a ¥╬ ╬§±;×±¢ ±└;×¤└×¤└╬¤┐╬└×╬ ┐¤; ╬┐ ×¢Ø{¤ ;╬¢¤ └╬{╬;;a¢±Ø ╬└×¢╬/¤¢ ¤ ;/¤ @±¥¤ ¤Ø ┐/¢╬µØ└Ø┐±Ø



ß¤¢¤ ¥╬;ß╬¢x¤¢ ;╬¢¤  └╬{╬;;¤ ¢±Ø:  ;¤└u/╬ ¥╬ ╬µÞØ(└¤x/¢¤µ), /┐¤ ¢/└¤, ;¤└u/╬ ?/┐¤└Ø, ;¤└u/╬ ¥╬ /┐ {¤¥¤ @╬¢, ;¤└u/╬ ¥╬ Ø¢{ ╬ ¢╬{±x¤¢ Ø ;╬/ ┐¤±Ø¢ ;╬u¢╬¥Ø

┐¤u±¤ ß¢Ø└x¤: ╬;;¤ ?¤8±µ±¥¤╬ ±└±{±¤µ┐╬└x╬ ß¢╬{±;¤ Ð/╬ Ø /;/¤¢±Ø ¥Ø µ±@¢Ø {ØµØÐ/╬ /┐¤ ┐¤u±¤ ╬ ╬└x¤Ø ╬;;¤ ┐¤u±¤ Þ±{¤¢¤ ¢╬u±;x¢¤¥¤ └Ø µ±@¢Ø ╬ ßØ¥╬¢¤ ;╬¢ /;¤¥¤ ¤ Ð/¤µÐ/╬¢ ┐Ø┐╬└xØ u¤;x¤└¥Ø ¤ ┐╬;┐¤ Ð/¤└x±¥¤¥╬ ¥╬ ┐¤└¤ ┐¤; ¤/┐╬└x¤└¥Ø ¤ ÞØ¢ç¤ ¥Ø Þ╬±x±çØ,x¢Ø{¤ j/;x¤?: /┐¤ ?¤8±µ±¥¤¥╬ ╬§x¢╬┐¤┐╬└x╬ ÞØ¢x╬ ßØ¢╬┐ {Ø┐ ;╬/; ¢±;{Ø;, ╬;;¤ ?¤8±µ±¥¤¥╬ ¢╬¤µ±'¤¢ ¤ ┐¤±Ø¢±¤ ¥Ø; ß╬¥±¥Ø; ¥Ø /;/¤ ¢±Ø(;ó ßØ¥╬ /;¤¢ /┐¤ @╬') ßØ¢╬┐ ╬┐ x¢Ø{¤ ╬µ¤ ±¢¤  ß╬u¤¢ ¤µuØ ¥Ø /;/¤ ¢±Ø
""")
 alfabetoc = [
    "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m",
    "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z"
]

 keycodc=[
"¤",
"8",
"{",
"¥",
"╬",
"Þ",
"%", 
"?",
"±",
"¬",
"╔",
"µ",
"┐",
"└",
"Ø",#o
"ß",
"Ð",#q
"¢",
";",
"°",
"/",
"@",
"ð",
"§",
"|",
"'",
 ]

 textct=textct.lower()
 
 #text=text.replace(""," ")
 loopc=0
 for keycordc in alfabetoc:
  
  textct=textct.replace(keycodc[loopc],alfabetoc[loopc])
  loopc+=1
  
 print(textct)

desficar()